In [2]:
import sqlalchemy 
sqlalchemy.__version__

'1.4.32'

In [43]:
from sqlalchemy import MetaData, Table, create_engine, select, and_, or_, not_
from sqlalchemy.sql import func, exists

In [4]:
engine = create_engine('sqlite+pysqlite:////Users/vladislavvorosilov/Desktop/Python_SQL/Python_SQL_PI_2021_22_s2/Data/Students.db')
conn = engine.connect()

In [5]:
metadata = MetaData() 
metadata.reflect(bind=engine)

In [6]:
exam_marks=Table("exam_marks", metadata, autoload=True, autoload_with="engine")
lecturer=Table("lecturer", metadata, autoload=True, autoload_with="engine")
student=Table("student", metadata, autoload=True, autoload_with="engine")
subj_lect=Table("subj_lect", metadata, autoload=True, autoload_with="engine")
subject=Table("subject", metadata, autoload=True, autoload_with="engine")
university=Table("university", metadata, autolad=True, autolad_with="engine")

In [10]:
# Извлечь данные об оценках сутента Васильева.

subq = select(student.c.student_id)
subq = subq.where(student.c.surname=='Васильев').scalar_subquery()

s = select(exam_marks.c.mark)
s = s.where(exam_marks.c.student_id==subq)

print(s)
print(s.compile().params)
result = conn.execute(s).fetchall()
result

SELECT exam_marks.mark
FROM exam_marks
WHERE exam_marks.student_id = (SELECT student.student_id
FROM student
WHERE student.surname = :surname_1)
{'surname_1': 'Васильев'}

[(3,), (5,)]

In [11]:
# Найти студентов, у которых только отличные оценки.

# Студенты, сдававшие экзамен
subq1 = exists().where(and_(exam_marks.c.mark != None, exam_marks.c.student_id == student.c.student_id))

# Студенты, не имеющие оценок, кроме отличных
subq2 = ~exists().where(and_(exam_marks.c.mark < 5, exam_marks.c.student_id == student.c.student_id))
# ~ это для того, чтобы сделать NOT EXIST
s = select(student.c.student_id, student.c.name, student.c.surname)
s = s.where(subq1).where(subq2)

print(s, s.compile().params)

result = conn.execute(s).fetchall()
result

SELECT student.student_id, student.name, student.surname
FROM student
WHERE (EXISTS (SELECT *
FROM exam_marks
WHERE exam_marks.mark IS NOT NULL AND exam_marks.student_id = student.student_id)) AND NOT (EXISTS (SELECT *
FROM exam_marks
WHERE exam_marks.mark < :mark_1 AND exam_marks.student_id = student.student_id)) {'mark_1': 5}

[(10, 'Борис', 'Кузнецов'),
 (55, 'Вадим', 'Белкин'),
 (82, 'Элеонора', 'Лапина'),
 (88, 'Ирина', 'Жданова'),
 (91, 'Ираида', 'Блохина'),
 (92, 'Светлана', 'Мельникова'),
 (99, 'Марина', 'Борисова')]

## 1. Напишите запрос для получения списка студентов, которые учатся в своем городе.

In [14]:
subq = select(university.c.city)
subq = subq.where(university.c.univ_id == student.c.univ_id).scalar_subquery()

s = select(student)
s = s.where(student.c.city == subq)

print(s)
result = conn.execute(s).fetchall()
result

SELECT student.student_id, student.surname, student.name, student.stipend, student.kurs, student.city, student.birthday, student.univ_id
FROM student
WHERE student.city = (SELECT university.city
FROM university
WHERE university.univ_id = student.univ_id)

[(6, 'Сидоров', 'Вадим', 150, 4, 'Москва', datetime.datetime(1999, 6, 7, 0, 0), 22),
 (32, 'Котов', 'Павел', 150, 5, 'Белгород', datetime.datetime(2001, 2, 28, 0, 0), 14),
 (55, 'Белкин', 'Вадим', 250, 5, 'Воронеж', datetime.datetime(2000, 1, 7, 0, 0), 10),
 (58, 'Журавлева', 'Вера', 0, 4, 'Новосибирск', datetime.datetime(2003, 6, 14, 0, 0), 11),
 (200, 'Баранов', 'Александр', 220, 2, 'Москва', datetime.datetime(2001, 8, 18, 0, 0), 44),
 (203, 'Петрова', 'Екатерина', 250, 4, 'Белгород', datetime.datetime(2001, 5, 21, 0, 0), 14),
 (207, 'Миронова', 'Федор', 200, 3, 'Москва', datetime.datetime(2002, 4, 15, 0, 0), 45),
 (265, 'Павлов', 'Андрей', 0, 3, 'Воронеж', datetime.datetime(2000, 11, 5, 0, 0), 10),
 (654, 'Лукин', 'Артем', 200, 3, 'Воронеж', datetime.datetime(2001, 12, 1, 0, 0), 10)]

## 2. Напишите запрос для получения списка иногородних студентов (обучающихся не в своем городе), с последующей сортировкой по идентификаторам университетов и курсам.

In [16]:
subq = select(university.c.city)
subq = subq.where(university.c.univ_id == student.c.univ_id).scalar_subquery()

s = select(student)
s = s.where(student.c.city != subq)
s = s.order_by(student.c.univ_id, student.c.kurs)

print(s)
result = conn.execute(s).fetchall()
result[:10]

SELECT student.student_id, student.surname, student.name, student.stipend, student.kurs, student.city, student.birthday, student.univ_id
FROM student
WHERE student.city != (SELECT university.city
FROM university
WHERE university.univ_id = student.univ_id) ORDER BY student.univ_id, student.kurs

[(1, 'Иванов', 'Иван', 150, 1, 'Орел', datetime.datetime(2002, 12, 3, 0, 0), 10),
 (78, 'Агафонов', 'Василий', 150, 1, 'Грозный', datetime.datetime(1994, 10, 29, 0, 0), 10),
 (99, 'Борисова', 'Марина', 150, 1, 'Рославль', datetime.datetime(1995, 8, 7, 0, 0), 10),
 (113, 'Аксенов', 'Валерий', 150, 1, 'Мурманск', datetime.datetime(1994, 10, 27, 0, 0), 10),
 (10, 'Кузнецов', 'Борис', 0, 2, 'Брянск', datetime.datetime(2001, 12, 8, 0, 0), 10),
 (12, 'Зайцева', 'Ольга', 250, 2, 'Липецк', datetime.datetime(2001, 5, 1, 0, 0), 10),
 (66, 'Некрасова', 'Вероника', 250, 2, 'Иркутск', datetime.datetime(2004, 8, 23, 0, 0), 10),
 (3, 'Петров', 'Петр', 200, 3, 'Курск', datetime.datetime(2000, 12, 1, 0, 0), 10),
 (62, 'Семенова', 'Вероника', 0, 3, 'Вологда', datetime.datetime(2003, 10, 4, 0, 0), 10),
 (88, 'Жданова', 'Ирина', 200, 3, 'Тверь', datetime.datetime(2002, 3, 2, 0, 0), 10)]

## 3. Напишите запрос для получения списка преподавателей, работающих не в своем городе, с последующей сортировкой по идентификаторам университетов и городам проживания преподавателей.

In [17]:
subq = select(university.c.city)
subq = subq.where(university.c.univ_id == lecturer.c.univ_id).scalar_subquery()

s = select(lecturer)
s = s.where(lecturer.c.city != subq)
s = s.order_by(lecturer.c.univ_id, lecturer.c.city)

print(s)
result = conn.execute(s).fetchall()
result[:10]

SELECT lecturer.lecturer_id, lecturer.surname, lecturer.name, lecturer.city, lecturer.univ_id
FROM lecturer
WHERE lecturer.city != (SELECT university.city
FROM university
WHERE university.univ_id = lecturer.univ_id) ORDER BY lecturer.univ_id, lecturer.city

[(2, 'Зайцева', 'Юлия', 'Белгород', 10),
 (13, 'Зыкова', 'Оксана', 'Калач', 10),
 (19, 'Алексеев', 'Елисей', 'Мценск', 10),
 (328, 'Сорокин', 'Андрей', 'Орел', 10),
 (6, 'Максимова', 'Иванна', 'Сковородино', 10),
 (3, 'Мамонтова', 'Акулина', 'Троицк (Моск.)', 11),
 (20, 'Тихонов', 'Ладомир', 'Кропоткин (Краснод.)', 15),
 (22, 'Беспалов', 'Юлиан', 'Рыбинск', 15),
 (9, 'Крюкова', 'Людмила', 'Анива', 18),
 (4, 'Богданова', 'Оксана', 'Всеволожск', 18)]

## 4. Напишите запрос для получения списка предметов, на изучение которых отведено максимальное количество часов среди всех предметов, изучаемых в том же семестре. Список упорядочить по семестрам.

In [22]:
s1 = subject.alias('s1')
subq = select(func.max(s1.c.hour))
subq = subq.where(s1.c.semester == subject.c.semester).scalar_subquery()

s = select(subject)
s = s.where(subject.c.hour == subq)
s = s.order_by(subject.c.semester)

print(s)
result = conn.execute(s).fetchall()
result[:10]

SELECT subject.subj_id, subject.subj_name, subject.hour, subject.semester
FROM subject
WHERE subject.hour = (SELECT max(s1.hour) AS max_1
FROM subject AS s1
WHERE s1.semester = subject.semester) ORDER BY subject.semester

[(10, 'Информатика', 56, 1),
 (43, 'Математика', 56, 2),
 (94, 'Английский язык', 56, 3),
 (23, 'Теория вероятностей и математическая статистика', 72, 4),
 (73, 'Физкультура', 34, 5)]

## 5. Напишите запрос для получения списка студентов, получающих стипендию, превосходящую среднее значение стипендии на их курсе.

In [25]:
s1 = student.alias('s1')
subq = select(func.avg(s1.c.stipend))
subq = subq.where(s1.c.kurs == student.c.kurs).scalar_subquery()

s = select(student)
s = s.where(student.c.stipend > subq)


print(s)
result = conn.execute(s).fetchall()
print(len(result))
result[:10]

SELECT student.student_id, student.surname, student.name, student.stipend, student.kurs, student.city, student.birthday, student.univ_id
FROM student
WHERE student.stipend > (SELECT avg(s1.stipend) AS avg_1
FROM student AS s1
WHERE s1.kurs = student.kurs)
54

[(1, 'Иванов', 'Иван', 150, 1, 'Орел', datetime.datetime(2002, 12, 3, 0, 0), 10),
 (3, 'Петров', 'Петр', 200, 3, 'Курск', datetime.datetime(2000, 12, 1, 0, 0), 10),
 (6, 'Сидоров', 'Вадим', 150, 4, 'Москва', datetime.datetime(1999, 6, 7, 0, 0), 22),
 (12, 'Зайцева', 'Ольга', 250, 2, 'Липецк', datetime.datetime(2001, 5, 1, 0, 0), 10),
 (55, 'Белкин', 'Вадим', 250, 5, 'Воронеж', datetime.datetime(2000, 1, 7, 0, 0), 10),
 (64, 'Жук', 'Оксана', 250, 1, 'Воркута', datetime.datetime(2000, 11, 16, 0, 0), 47),
 (66, 'Некрасова', 'Вероника', 250, 2, 'Иркутск', datetime.datetime(2004, 8, 23, 0, 0), 10),
 (68, 'Казакова', 'Ольга', 250, 4, 'Кемерово', datetime.datetime(2000, 3, 29, 0, 0), 44),
 (70, 'Миронова', 'Анна', 200, 2, 'Владикавказ', datetime.datetime(2000, 10, 8, 0, 0), 46),
 (71, 'Кондрат', 'Синицин', 200, 4, 'Ишим', datetime.datetime(2001, 2, 23, 0, 0), 18)]

## 6. Напишите запрос для получения списка студентов, получающих минимальную стипендию в своем университете, с последующей сортировкой по значениям идентификатора университета и стипендии.

In [26]:
s1 = student.alias('s1')
subq = select(func.min(s1.c.stipend))
subq = subq.where(s1.c.univ_id == student.c.univ_id).scalar_subquery()

s = select(student)
s = s.where(student.c.stipend == subq)
s = s.order_by(student.c.univ_id, student.c.stipend)

print(s)
result = conn.execute(s).fetchall()
print(len(result))
result[:10]

SELECT student.student_id, student.surname, student.name, student.stipend, student.kurs, student.city, student.birthday, student.univ_id
FROM student
WHERE student.stipend = (SELECT min(s1.stipend) AS min_1
FROM student AS s1
WHERE s1.univ_id = student.univ_id) ORDER BY student.univ_id, student.stipend
18

[(10, 'Кузнецов', 'Борис', 0, 2, 'Брянск', datetime.datetime(2001, 12, 8, 0, 0), 10),
 (62, 'Семенова', 'Вероника', 0, 3, 'Вологда', datetime.datetime(2003, 10, 4, 0, 0), 10),
 (265, 'Павлов', 'Андрей', 0, 3, 'Воронеж', datetime.datetime(2000, 11, 5, 0, 0), 10),
 (58, 'Журавлева', 'Вера', 0, 4, 'Новосибирск', datetime.datetime(2003, 6, 14, 0, 0), 11),
 (126, 'Жуков', 'Пров', 0, 3, 'Кыштым', datetime.datetime(1998, 9, 11, 0, 0), 11),
 (90, 'Костина', 'Кира', 0, 4, 'Устюжна', datetime.datetime(1995, 7, 15, 0, 0), 14),
 (135, 'Комаров', 'Ипат', 0, 1, 'Нерчинск', datetime.datetime(2000, 7, 17, 0, 0), 14),
 (63, 'Пак', 'Ирина', 100, 1, 'Магадан', datetime.datetime(2000, 8, 22, 0, 0), 15),
 (124, 'Юдин', 'Савва', 0, 2, 'Усинск', datetime.datetime(2001, 12, 2, 0, 0), 18),
 (74, 'Гуляева', 'Рукижат', 0, 3, 'Невельск (Сахалин)', datetime.datetime(2002, 7, 23, 0, 0), 22)]

## 7. Напишите запрос для получения списка университетов, в которых учится более 50 студентов, с последующей сортировкой по рейтингам.

In [31]:
subq = select(func.count(student.c.student_id))
subq = subq.where(student.c.univ_id == university.c.univ_id).scalar_subquery()

s = select(university)
s = s.where(subq > 5)
s = s.order_by(university.c.rating)

print(s)
result = conn.execute(s).fetchall()
print(len(result))
result[:10]

SELECT university.univ_id, university.univ_name, university.rating, university.city
FROM university
WHERE (SELECT count(student.student_id) AS count_1
FROM student
WHERE student.univ_id = university.univ_id) > :param_1 ORDER BY university.rating
8

[(47, 'КФУ', None, 'Казань'),
 (10, 'ВГУ', 296, 'Воронеж'),
 (46, 'ФГБОУ "Политех"', 304, 'Санкт-Петербург'),
 (14, 'БГУ', 326, 'Белгород'),
 (18, 'ВГМА', 327, 'Воронеж'),
 (44, 'ФинУ', 330, 'Москва'),
 (32, 'РГУ', 416, 'Ростов'),
 (22, 'МГУ', 606, 'Москва')]

## 8. Напишите запрос для получения списка университетов, в которых работает более 5 преподавателей, с последующей сортировкой по рейтингам университетов.

In [33]:
subq = select(func.count(lecturer.c.lecturer_id))
subq = subq.where(lecturer.c.univ_id == university.c.univ_id).scalar_subquery()

s = select(university)
s = s.where(subq > 5)
s = s.order_by(university.c.rating)

print(s)
result = conn.execute(s).fetchall()
print(len(result))
result[:10]

SELECT university.univ_id, university.univ_name, university.rating, university.city
FROM university
WHERE (SELECT count(lecturer.lecturer_id) AS count_1
FROM lecturer
WHERE lecturer.univ_id = university.univ_id) > :param_1 ORDER BY university.rating
1

[(10, 'ВГУ', 296, 'Воронеж')]

## 9. Напишите запрос для получения списка отличников (студентов, получивших только отличные оценки), с последующей сортировкой по идентификаторам университетов и курсам.

In [36]:
subq = select(func.min(exam_marks.c.mark))
subq = subq.where(exam_marks.c.student_id == student.c.student_id).scalar_subquery()

s = select(student)
s = s.where(subq == 5)
s = s.order_by(student.c.univ_id, student.c.kurs)

print(s)
result = conn.execute(s).fetchall()
print(len(result))
result[:10]

SELECT student.student_id, student.surname, student.name, student.stipend, student.kurs, student.city, student.birthday, student.univ_id
FROM student
WHERE (SELECT min(exam_marks.mark) AS min_1
FROM exam_marks
WHERE exam_marks.student_id = student.student_id) = :param_1 ORDER BY student.univ_id, student.kurs
7

[(99, 'Борисова', 'Марина', 150, 1, 'Рославль', datetime.datetime(1995, 8, 7, 0, 0), 10),
 (10, 'Кузнецов', 'Борис', 0, 2, 'Брянск', datetime.datetime(2001, 12, 8, 0, 0), 10),
 (88, 'Жданова', 'Ирина', 200, 3, 'Тверь', datetime.datetime(2002, 3, 2, 0, 0), 10),
 (55, 'Белкин', 'Вадим', 250, 5, 'Воронеж', datetime.datetime(2000, 1, 7, 0, 0), 10),
 (92, 'Мельникова', 'Светлана', 250, 4, 'Кропоткин (Краснод.)', datetime.datetime(1998, 3, 24, 0, 0), 15),
 (91, 'Блохина', 'Ираида', 250, 3, 'Новый Уренгой', datetime.datetime(1997, 3, 23, 0, 0), 22),
 (82, 'Лапина', 'Элеонора', 150, 3, 'Джубга', datetime.datetime(1997, 11, 23, 0, 0), 45)]

## 10. Напишите запрос для получения списка неуспевающих студентов (получивших хотя бы одну неудовлетворительную оценку), с последующей сортировкой по идентификаторам университетов и курсам.

In [37]:
subq = select(func.min(exam_marks.c.mark))
subq = subq.where(exam_marks.c.student_id == student.c.student_id).scalar_subquery()

s = select(student)
s = s.where(subq < 3)
s = s.order_by(student.c.univ_id, student.c.kurs)

print(s)
result = conn.execute(s).fetchall()
print(len(result))
result[:10]

SELECT student.student_id, student.surname, student.name, student.stipend, student.kurs, student.city, student.birthday, student.univ_id
FROM student
WHERE (SELECT min(exam_marks.mark) AS min_1
FROM exam_marks
WHERE exam_marks.student_id = student.student_id) < :param_1 ORDER BY student.univ_id, student.kurs
18

[(1, 'Иванов', 'Иван', 150, 1, 'Орел', datetime.datetime(2002, 12, 3, 0, 0), 10),
 (12, 'Зайцева', 'Ольга', 250, 2, 'Липецк', datetime.datetime(2001, 5, 1, 0, 0), 10),
 (116, 'Федоров', 'Гостомысл', 100, 4, 'Новый Уренгой', datetime.datetime(2000, 11, 16, 0, 0), 10),
 (65, 'Сергеева', 'Фёкла', 100, 5, None, datetime.datetime(2000, 2, 19, 0, 0), 10),
 (76, 'Мельникова', 'Дарья', 100, 5, 'Архангельск', datetime.datetime(2002, 8, 1, 0, 0), 10),
 (123, 'Веселов', 'Тимур', 150, 1, 'Невинномысск', datetime.datetime(1998, 4, 28, 0, 0), 11),
 (126, 'Жуков', 'Пров', 0, 3, 'Кыштым', datetime.datetime(1998, 9, 11, 0, 0), 11),
 (103, 'Трофимов', 'Владислав', 250, 5, 'Верхоянск', datetime.datetime(1995, 3, 24, 0, 0), 11),
 (110, 'Суханов', 'Константин', 250, 3, 'Курск', datetime.datetime(1996, 11, 22, 0, 0), 14),
 (149, 'Вячеслав', 'Пахомов', 250, 3, 'Игарка', datetime.datetime(1997, 5, 14, 0, 0), 14)]

# Следующий раздел задач

## 1. Напишите команду SELECT, использующую связанные подзапросы и выполняющую вывод имен и идентификаторов студентов, у которых стипендия совпадает с максимальным значением стипендии для города, в котором живет студент.

In [39]:
subq = select(func.max(student.c.stipend))
subq = subq.group_by(student.c.city).scalar_subquery()

s = select(student)
s = s.where(student.c.stipend == subq)
s = s.order_by(student.c.univ_id, student.c.kurs)

print(s)
result = conn.execute(s).fetchall()
print(len(result))
result[:10]

SELECT student.student_id, student.surname, student.name, student.stipend, student.kurs, student.city, student.birthday, student.univ_id
FROM student
WHERE student.stipend = (SELECT max(student.stipend) AS max_1
FROM student GROUP BY student.city) ORDER BY student.univ_id, student.kurs
22

[(1, 'Иванов', 'Иван', 150, 1, 'Орел', datetime.datetime(2002, 12, 3, 0, 0), 10),
 (78, 'Агафонов', 'Василий', 150, 1, 'Грозный', datetime.datetime(1994, 10, 29, 0, 0), 10),
 (99, 'Борисова', 'Марина', 150, 1, 'Рославль', datetime.datetime(1995, 8, 7, 0, 0), 10),
 (113, 'Аксенов', 'Валерий', 150, 1, 'Мурманск', datetime.datetime(1994, 10, 27, 0, 0), 10),
 (123, 'Веселов', 'Тимур', 150, 1, 'Невинномысск', datetime.datetime(1998, 4, 28, 0, 0), 11),
 (118, 'Кондратьев', 'Николай', 150, 3, 'Ханты-Мансийск', datetime.datetime(1999, 10, 28, 0, 0), 14),
 (32, 'Котов', 'Павел', 150, 5, 'Белгород', datetime.datetime(2001, 2, 28, 0, 0), 14),
 (77, 'Мишина', 'Светлана', 150, 2, 'Рыльск', datetime.datetime(1997, 5, 22, 0, 0), 18),
 (6, 'Сидоров', 'Вадим', 150, 4, 'Москва', datetime.datetime(1999, 6, 7, 0, 0), 22),
 (133, 'Жуковский', 'Юрий', 150, 4, 'Сургут (Хант.)', datetime.datetime(1996, 5, 30, 0, 0), 22)]

## 2. Напишите запрос, который позволяет вывести имена и идентификаторы всех студентов, о которых точно известно, что они проживают в городе, где нет ни одного университета.

In [48]:
subq = select(func.distinct(university.c.city))
subq = subq.group_by(university.c.city).scalar_subquery()

s = select(student)
s = s.where(student.c.city.notin_(subq))
s = s.order_by(student.c.univ_id, student.c.kurs)

print(s)
result = conn.execute(s).fetchall()
print(len(result))
result[:10]

SELECT student.student_id, student.surname, student.name, student.stipend, student.kurs, student.city, student.birthday, student.univ_id
FROM student
WHERE (student.city NOT IN (SELECT distinct(university.city) AS distinct_1
FROM university GROUP BY university.city)) ORDER BY student.univ_id, student.kurs
77

[(1, 'Иванов', 'Иван', 150, 1, 'Орел', datetime.datetime(2002, 12, 3, 0, 0), 10),
 (78, 'Агафонов', 'Василий', 150, 1, 'Грозный', datetime.datetime(1994, 10, 29, 0, 0), 10),
 (99, 'Борисова', 'Марина', 150, 1, 'Рославль', datetime.datetime(1995, 8, 7, 0, 0), 10),
 (113, 'Аксенов', 'Валерий', 150, 1, 'Мурманск', datetime.datetime(1994, 10, 27, 0, 0), 10),
 (10, 'Кузнецов', 'Борис', 0, 2, 'Брянск', datetime.datetime(2001, 12, 8, 0, 0), 10),
 (12, 'Зайцева', 'Ольга', 250, 2, 'Липецк', datetime.datetime(2001, 5, 1, 0, 0), 10),
 (66, 'Некрасова', 'Вероника', 250, 2, 'Иркутск', datetime.datetime(2004, 8, 23, 0, 0), 10),
 (3, 'Петров', 'Петр', 200, 3, 'Курск', datetime.datetime(2000, 12, 1, 0, 0), 10),
 (62, 'Семенова', 'Вероника', 0, 3, 'Вологда', datetime.datetime(2003, 10, 4, 0, 0), 10),
 (88, 'Жданова', 'Ирина', 200, 3, 'Тверь', datetime.datetime(2002, 3, 2, 0, 0), 10)]

## 3. Напишите два запроса, которые позволяют вывести имена и идентификаторы всех студентов, о которых точно известно, что они проживают не в том городе, где расположен их университет: один запрос с использованием связанного подзапроса, а другой с использованием соединения.

In [50]:
subq = select(university.c.city)
subq = subq.where(student.c.univ_id == university.c.univ_id).scalar_subquery()

s = select(student)
s = s.where(student.c.city != subq)
s = s.order_by(student.c.univ_id, student.c.kurs)

print(s)
result = conn.execute(s).fetchall()
print(len(result))
result[:10]

SELECT student.student_id, student.surname, student.name, student.stipend, student.kurs, student.city, student.birthday, student.univ_id
FROM student
WHERE student.city != (SELECT university.city
FROM university
WHERE student.univ_id = university.univ_id) ORDER BY student.univ_id, student.kurs
79

[(1, 'Иванов', 'Иван', 150, 1, 'Орел', datetime.datetime(2002, 12, 3, 0, 0), 10),
 (78, 'Агафонов', 'Василий', 150, 1, 'Грозный', datetime.datetime(1994, 10, 29, 0, 0), 10),
 (99, 'Борисова', 'Марина', 150, 1, 'Рославль', datetime.datetime(1995, 8, 7, 0, 0), 10),
 (113, 'Аксенов', 'Валерий', 150, 1, 'Мурманск', datetime.datetime(1994, 10, 27, 0, 0), 10),
 (10, 'Кузнецов', 'Борис', 0, 2, 'Брянск', datetime.datetime(2001, 12, 8, 0, 0), 10),
 (12, 'Зайцева', 'Ольга', 250, 2, 'Липецк', datetime.datetime(2001, 5, 1, 0, 0), 10),
 (66, 'Некрасова', 'Вероника', 250, 2, 'Иркутск', datetime.datetime(2004, 8, 23, 0, 0), 10),
 (3, 'Петров', 'Петр', 200, 3, 'Курск', datetime.datetime(2000, 12, 1, 0, 0), 10),
 (62, 'Семенова', 'Вероника', 0, 3, 'Вологда', datetime.datetime(2003, 10, 4, 0, 0), 10),
 (88, 'Жданова', 'Ирина', 200, 3, 'Тверь', datetime.datetime(2002, 3, 2, 0, 0), 10)]

# Блок заданий с EXISTS